while True:
	try:
		azb = {'A': '.-',     'B': '-...',   'C': '-.-.',
					'D': '-..',    'E': '.',      'F': '..-.',
					'G': '--.',    'H': '....',   'I': '..',
					'J': '.---',   'K': '-.-',    'L': '.-..',
					'M': '--',     'N': '-.',     'O': '---',
					'P': '.--.',   'Q': '--.-',   'R': '.-.',
					'S': '...',    'T': '-',      'U': '..-',
					'V': '...-',   'W': '.--',    'X': '-..-',
					'Y': '-.--',   'Z': '--..',
					'0': '-----',  '1': '.----',  '2': '..---',
					'3': '...--',  '4': '....-',  '5': '.....',
					'6': '-....',  '7': '--...',  '8': '---..',
					'9': '----.'
		}
		x = input('\nВведте слово на английском, что бы вывести перевод на Азбуке Морзе\n')
		x = str(x).upper()
		for i in x:
			if i in azb.keys():
				y = azb[i]
				print(f'{y}', sep="; ", end="   ")


	except Exception as err:
		print(err)